#include "stdafx.h"
#include <iostream>
using namespace std;


int main()
{
	setlocale(LC_ALL, "rus");
	int choice;
	cout << "Введите день недели ";
	cin >> choice;

	switch (choice)
	{
	case 1:
	{cout << "Понедельник:" << endl;
	cout << "15:40 - 17:15 Аналитическая геометрия(семинар)" << endl;
	cout << "17:25 - 19:00 Математический анализ(семинар)" << endl;
	break; }
	case 2:
	{cout << "Вторник:" << endl;
	cout << "8:30 - 10:05 Теоретическая информатика(лекция)" << endl;
	cout << "10:15 - 11:50 Алгоритмические языки(лекция)" << endl;
	cout << "12:00 - 13:35 Физ воспитание(лекция)" << endl;
	break; }
	case 3:
	{cout << "Среда:" << endl;
	cout << "13:50 - 15:25 Инженерная графика(семинар)" << endl;
	cout << "15:40 - 17:15 Аналитическая геометрия(лекция)" << endl;
	break; }
	case 4:
	{cout << "Четверг:" << endl;
	cout << "08:30 - 10:05 Математический анализ(лекция)" << endl;
	cout << "10:15 - 11:50 Теоретическая информатика(семинар)" << endl;
	break; }
	case 5:
	{cout << "Пятница" << endl;
	cout << "10:15 - 11:50 Алгоритмические языки(семинар)" << endl;
	cout << "12:00 - 13:35 Алгоритмические языки(лабораторные работы)" << endl;
	break; }
	case 6:
	{cout << "Суббота:" << endl;
	cout << "10:15 - 11:50 Физ воспитание" << endl;
	cout << "12:00 - 13:35 История" << endl;
	cout << "13:00 - 15:25 Иностранный язык" << endl;
	break; }
	case 7:
	{cout << "Выходной" << endl;
	break; }
	default:
		cout << "Нет такого дня недели ";
	}
	system("pause");
}

